In [1]:
import pandas as pd
import numpy as np

C:\Users\Isabel\AppData\Local\Temp\ipykernel_384\2162656668.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [5]:
df = pd.read_csv('HR RAW DATA.csv')

df

,Unnamed: 0,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,...,20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,...,33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,...,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,...,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,...,19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,...,16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,...,9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,...,8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,...,7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,...,8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [25]:
df.loc[df.employeecount != 1]

Empty DataFrame
Columns: [Unnamed: 0, Age, Attrition, BusinessTravel, DailyRate, Department, DistanceFromHome, Education, EducationField, employeecount, employeenumber, EnvironmentSatisfaction, Gender, HourlyRate, JobInvolvement, JobLevel, JobRole, JobSatisfaction, MaritalStatus, MonthlyIncome, MonthlyRate, NUMCOMPANIESWORKED, Over18, OverTime, PercentSalaryHike, PerformanceRating, RelationshipSatisfaction, StandardHours, StockOptionLevel, TOTALWORKINGYEARS, TrainingTimesLastYear, WORKLIFEBALANCE, YearsAtCompany, YearsInCurrentRole, YearsSinceLastPromotion, YEARSWITHCURRMANAGER, SameAsMonthlyIncome, DateBirth, Salary, RoleDepartament, NUMBERCHILDREN, RemoteWork]
Index: []

[0 rows x 42 columns]

In [91]:
df_inspec = df.iloc[:, 11:20]

In [23]:
df_inspec.sample(10)

,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome
449,3,1,51,3,2,SAles REpReSENtaTiVE,4,Single,"4502,0"
400,4,1,38,3,2,resEArch scIENTisT,3,Single,NaN
206,3,0,42,2,3,REsEARCH dIReCTor,4,Divorced,"12808,0"
956,1,1,78,2,3,sALes ExEcUtiVE,4,Married,"10934,0"
793,3,1,98,3,1,reSearcH sCiENTist,3,Married,"2001,0"
1509,3,0,83,3,3,reSearCh DIRectOR,1,Married,NaN
310,2,0,77,1,1,LaborAtORY TechNIciaN,1,NaN,"2119,0"
1497,1,1,83,3,1,resEaRcH sCIeNTisT,3,NaN,NaN
1314,3,1,71,3,1,reSeARCH SCIenTiST,3,NaN,"2083,0"
965,4,1,33,3,2,hEaLtHCaRE rEPReSeNTAtIvE,4,Married,"5562,0"

In [16]:
df_inspec.dtypes

EnvironmentSatisfaction     int64
Gender                      int64
HourlyRate                 object
JobInvolvement              int64
JobLevel                    int64
JobRole                    object
JobSatisfaction             int64
MaritalStatus              object
MonthlyIncome              object
dtype: object

In [18]:
df.iloc[:, 31:42]

,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...
1609,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

- unificar títulos de columnas
- porcentajes float/integer
- unificar strings en title
- las cuantías que sean string pasarlas a float/integer
- yes/no unificar >> True/False
- RemoteWork unificar a yes/no >> True/False
- comprobar si hay números negativos

ines:

- Age(object) --- age(int64)
- Attrition(object) ----- attrition(booleano) 
- BussinessTravel(object) ------ bussiness_travel(object)
- DailyRate(object) -------- daily_rate(float) (quitar el símbolo de la moneda) (mirar a ver si hay algún minus)
- Department(object) ---------department(object)
- DistanceFromHome(int64) --------distance_from_home(int64) (hay algún minus)
- Education(int64) --------- education(int64)
- EducationField(object) ------- education_field(object)
- employeecount  --- son todos 1?
- employeenumber(object) ---------employee_number(int)

mirna:
- empresas: int
- +18 = true/false
- overtime = true/false
- % = float (/100)
- calificacion rendimiento = int / nan
- standard hours = int / nan
- stock_op = int
- total_working = int/nan
- training = int

johanna:

- YearsAtCompany               int64  
- YearsInCurrentRole          object - NaN / Float
- YearsSinceLastPromotion      int64
- YEARSWITHCURRMANAGER         int64
- SameAsMonthlyIncome         object - NaN /Float
- DateBirth                    int64
- Salary                      object - Dolar $  - Cambio 
- RoleDepartament             object
- NUMBERCHILDREN             float64 - NaN
- RemoteWork                  object -  True/ False

# HACER COSAS

- Satisfaction: intuyo que es una escala 1-100??? --- int

- Gender: 0 - 1 > pasar a M, F --- int

- HourlyRate: tarifa por hora --- object
    - "Not Available" = cambiar por NaN 

- JobInvolvement: intuyo que escala 1-5 ---int [COMPROBAR]

- JobLevel: nivel jerárquico --- int

- JobRole: hay que arreglar estos strings --- objetc

- JobSatisfaction: escala 1-5 --- int [COMPROBAR]

- MaritalStatus: Married, Divorced, Single, NaN --- object

- MonthlyIncome: float --- object (cambiar coma por punto)

In [95]:
df_inspec['MaritalStatus']

0            NaN
1            NaN
2        married
3        married
4       divorced
          ...
1609     married
1610         NaN
1611      single
1612    divorced
1613         NaN
Name: MaritalStatus, Length: 1614, dtype: object

# COSAS HECHAS:

In [94]:
df_inspec['MaritalStatus'] = df_inspec['MaritalStatus'].str.lower()

In [48]:
df_inspec['Gender'] = df_inspec['Gender'].replace(1, 'F').replace(0, 'M')

In [50]:
df_inspec['HourlyRate'] = df_inspec['HourlyRate'].replace('Not Available', np.nan)

In [53]:
print(min(df_inspec['JobSatisfaction']))
print(max(df_inspec['JobSatisfaction']))

1
4

In [52]:
print(min(df_inspec['JobLevel']))
print(max(df_inspec['JobLevel']))

1
5

In [51]:
print(min(df_inspec['JobInvolvement']))
print(max(df_inspec['JobInvolvement']))

1
4

# COMPROBACIONES (OTRAS)

In [97]:
df

,Unnamed: 0,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,...,20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,...,33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,...,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,...,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,...,19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,...,16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,...,9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,...,8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,...,7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,...,8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [105]:
for elemento in df.StandardHours:
    if type(elemento) == str:
        df.StandardHours = df.StandardHours.replace(',', '.').astype(float)

In [106]:
df.StandardHours

0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
        ..
1609   NaN
1610   NaN
1611   NaN
1612   NaN
1613   NaN
Name: StandardHours, Length: 1614, dtype: float64

ines:

- Age(object) --- age(int64)
- Attrition(object) ----- attrition(booleano) 
- BussinessTravel(object) ------ bussiness_travel(object)
- DailyRate(object) -------- daily_rate(float) (quitar el símbolo de la moneda) (mirar a ver si hay algún minus)
- Department(object) ---------department(object)
- DistanceFromHome(int64) --------distance_from_home(int64) (hay algún minus)
- Education(int64) --------- education(int64)
- EducationField(object) ------- education_field(object)
- employeecount  --- son todos 1?
- employeenumber(object) ---------employee_number(int)

In [109]:
df.employeenumber = df.employeenumber.str.replace(',', '.').astype(float)

In [113]:
df.EducationField =  df.EducationField.str.lower()

In [120]:
df.DistanceFromHome = df.DistanceFromHome.replace('-','')